phygeonet-master/case3/TemplateCase0.0/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.49 -0.245 0.005)
(-0.47 -0.245 0.005)
(-0.45 -0.245 0.005)
(-0.43 -0.245 0.005)
(-0.41 -0.245 0.005)
(-0.39 -0.245 0.005)
(-0.37 -0.245 0.005)
(-0.35 -0.245 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.5 -0.245 0.005)
(-0.5 -0.235 0.005)
(-0.5 -0.225 0.005)
(-0.5 -0.215 0.005)
(-0.5 -0.205 0.005)
(-0.5 -0.195 0.005)
(-0.5 -0.185 0.005)
(-0.5 -0.175 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.5 -0.245 0.005)
(0.5 -0.235 0.005)
(0.5 -0.225 0.005)
(0.5 -0.215 0.005)
(0.5 -0.205 0.005)
(0.5 -0.195 0.005)
(0.5 -0.185 0.005)
(0.5 -0.175 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
