phygeonet-master/case3/TemplateCase0.0/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.245
-0.245
-0.245
-0.245
-0.245
-0.245
-0.245
-0.245
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245
-0.235
-0.225
-0.215
-0.205
-0.195
-0.185
-0.175
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245
-0.235
-0.225
-0.215
-0.205
-0.195
-0.185
-0.175
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.25
0.25
0.25
0.25
0.25
0.25
0.25
0.25
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
